In [14]:
import pandas as pd

In [28]:
!pip install PyMySQL

Requirement already satisfied: PyMySQL in /opt/anaconda3/lib/python3.11/site-packages (1.1.1)

In [4]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.11/site-packages (1.4.52)

In [15]:
from sqlalchemy import create_engine
import pymysql
import json

In [27]:
with open('cred.json','r') as fp:
    data = json.load(fp)
data

{'db_name': 'django_mysql',
 'user_name': 'root',
 'password': 'root',
 'engine': 'mysql',
 'library': 'pymysql',
 'port': '3306'}

In [72]:

conn = create_engine("{}+{}://{}:{}@localhost:{}/{}".format(data['engine'],data['library'],
                                                           data['user_name'],data['password'],
                                                           data['port'],data['db_name']))

In [73]:
conn

Engine(mysql+pymysql://root:***@localhost:3306/django_mysql)

In [74]:
df = pd.read_sql_table('loan_loantablemodel',conn)

In [75]:
df

   id  LOAN_NUMBER Customer_NAME  Loan_AMMOunt       Date
0   1          234           sdc       53245.0 2024-07-26
1   2         4839        shhsdv        1234.0 2024-07-15

In [89]:
df1 = pd.read_sql_query('select * from django_admin_log;',conn)

In [90]:
df1

,id,action_time,object_id,object_repr,action_flag,change_message,content_type_id,user_id
0,1,2024-07-04 08:49:01.186869,1,LoanTableModel object (1),1,"[{""added"": {}}]",8,1
1,2,2024-07-04 08:49:15.204508,2,LoanTableModel object (2),1,"[{""added"": {}}]",8,1

In [35]:
conn.table_names()

/var/folders/28/xzg4vjpj3gj6x32fqvxyzd440000gn/T/ipykernel_3502/745890199.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  conn.table_names()

['auth_group',
 'auth_group_permissions',
 'auth_permission',
 'auth_user',
 'auth_user_groups',
 'auth_user_user_permissions',
 'django_admin_log',
 'django_content_type',
 'django_migrations',
 'django_session',
 'loan_loanamount',
 'loan_loantablemodel']

In [124]:

def db_connect():
    conn = create_engine("{}+{}://{}:{}@localhost:{}/{}".format(data['engine'],data['library'],
                                                           data['user_name'],data['password'],
                                                           data['port'],data['db_name']))
    return conn

def df_creation(conn):
    print(conn)
    list_ = ['auth_user_groups','django_session','django_admin_log']
    dataframe = {}   
    for table in list_:
        df = pd.read_sql_table(table,conn)
        dataframe[table]=df
       
    return dataframe
    

def csv_dump(data):
    for table,df in data.items():
        filename = f"{table}.csv"
        df.to_csv(filename,index=False)
        print(f"Saved {filename}")

def main():
    conn = db_connect()
    dataframe = df_creation(conn)
    csv_dump(dataframe)

    


if __name__ == '__main__':
    main()

Engine(mysql+pymysql://root:***@localhost:3306/django_mysql)
Saved auth_user_groups.csv
Saved django_session.csv
Saved django_admin_log.csv

In [125]:
ls

3006.csv                    cred.json
Booth Analysis .xlsx        demo.json
Day-2 -DB connecting.ipynb  django_admin_log.csv
Pandas/                     django_session.csv
auth_user_groups.csv        shubham-photo/
coffee.csv

In [130]:
pd.read_sql('select * from django_admin_log ',conn)

,id,action_time,object_id,object_repr,action_flag,change_message,content_type_id,user_id
0,1,2024-07-04 08:49:01.186869,1,LoanTableModel object (1),1,"[{""added"": {}}]",8,1
1,2,2024-07-04 08:49:15.204508,2,LoanTableModel object (2),1,"[{""added"": {}}]",8,1

In [131]:
pd.read_sql_query('select * from django_admin_log ',conn)

,id,action_time,object_id,object_repr,action_flag,change_message,content_type_id,user_id
0,1,2024-07-04 08:49:01.186869,1,LoanTableModel object (1),1,"[{""added"": {}}]",8,1
1,2,2024-07-04 08:49:15.204508,2,LoanTableModel object (2),1,"[{""added"": {}}]",8,1

In [164]:
pd.read_sql_table('django_admin_log',conn)

In [173]:
df = pd.read_csv('django_session.csv')
df.to_sql(name= 'shub',con=conn,index=False,if_exists='replace')

In [174]:
pd.read_sql('select * from shub;',conn)

,session_key,session_data,expire_date
0,h5krkxv9w4bg5i5qanbjol0fie3i2k8k,.eJxVjEEOwiAQRe_C2hA6wBRcuvcMZGBAqoYmpV0Z765Nu...,2024-07-18 08:48:46.599963

In [ ]:
pd.read

In [177]:
df.to_html('session.html')

In [178]:
df.to_dict()

{'session_key': {0: 'h5krkxv9w4bg5i5qanbjol0fie3i2k8k'},
 'session_data': {0: '.eJxVjEEOwiAQRe_C2hA6wBRcuvcMZGBAqoYmpV0Z765NutDtf-_9lwi0rTVsPS9hYnEWgzj9bpHSI7cd8J3abZZpbusyRbkr8qBdXmfOz8vh_h1U6vVbA3tHaGyy2mqFCQuSjioSANgBfYSE7I1Gg64UE7VTDCOPmTh7o0C8P8VnN0I:1sPI90:PlZqkUl9jBFMrKAZBdB9uNVIG-9pTvEqChIOZVhCjek'},
 'expire_date': {0: '2024-07-18 08:48:46.599963'}}

In [194]:
df.to_feather('shub.feature')

In [195]:
df23 = pd.read_feather('shub.feature')

,session_key,session_data,expire_date
0,h5krkxv9w4bg5i5qanbjol0fie3i2k8k,.eJxVjEEOwiAQRe_C2hA6wBRcuvcMZGBAqoYmpV0Z765Nu...,2024-07-18 08:48:46.599963

In [9]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /opt/anaconda3/lib/python3.11/site-packages (2.9.9)

In [11]:
from sqlalchemy import create_engine
import psycopg2

In [46]:
engine = create_engine("postgresql+psycopg2://root:root@localhost:5432/root")

In [37]:
engine = create_engine("postgresql+psycopg2://postgres:root@localhost:5432/postgres")

In [41]:
df = pd.read_sql_table('shutable',engine)

In [42]:
df

    id   name  age
0   31   shub   33
1  301    ram   35
2  311  rahul   32
3    4   shub   33
4    1    ram   35
5   11  rahul   32

In [55]:
query ='''CREATE TABLE cars3 (
  brand VARCHAR(255),
  model VARCHAR(255),
  year INT
);'''

pd.read_sql_query('select * from cars2',engine)

Empty DataFrame
Columns: [brand, model, year]
Index: []

In [62]:
df.to_sql(name= 'shub',con=engine,index=False,if_exists='append')

In [63]:
pd.read_sql_table('shub',engine)

     id   name  age
0    31   shub   33
1   301    ram   35
2   311  rahul   32
3     4   shub   33
4     1    ram   35
5    11  rahul   32
6    31   shub   33
7   301    ram   35
8   311  rahul   32
9     4   shub   33
10    1    ram   35
11   11  rahul   32